wisteria-1c/Конфигурация/Enums/СостоянияДокументовЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СостоянияДокументовЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Аннулирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытПринудительно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытСОтклонением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытСОтклонениемПриглашения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытСОшибкойПередачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПолучен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСформирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбменЗавершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбменЗавершенСИсправлением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяИзвещениеОПолучении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяИзвещениеПоОтклонению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяИсправление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяОтветНаПриглашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяПередачаОператору</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяПодтверждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяПодтверждениеАннулирования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяПодтверждениеОператора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяИзвещениеОПолучении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяИзвещениеПоОтклонению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяИсправлениеОшибкиПередачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяОтправка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяОтправкаАннулирования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяОтправкаИзвещения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяОтправкаИзвещенияПоОтклонению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяОтправкаОтклонения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяОтправкаПриглашения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПовторнаяОтправка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПодготовкаКОтправке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПодготовкаКОтправкеАннулирования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПодготовкаКОтправкеИзвещения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПодготовкаКОтправкеИзвещенияПоОтклонению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПодготовкаКОтправкеОтклонения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПодписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПодписаниеАннулирования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПодписаниеИзвещения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПодписаниеИзвещенияПоОтклонению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПодписаниеОтклонения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПодтверждениеАннулирования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяУтверждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяУточнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьОжидаетсяВыписка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьОжидаетсяИзвещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьОжидаетсяИсполнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьОжидаетсяОтзыв</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьОжидаетсяОтправкаПолучателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьОтклоненОператором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПлатежИсполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьТребуетсяПодтверждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьОжидаетсяОбработкаОблачнымЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПодготовкаКОтправкеОтказаВПодписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяОтправкаОтказаВПодписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказаноВПодписиКонтрагенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрагентОтказалВПодписи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/СтатусыЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подключить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пригласить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Создать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утвердить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уточнить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исправить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПолучен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/CommonModules/ПодключаемыеСтатусыЭДО/Ext/Module.bsl
// @strict-types
// @skip-check invocation-parameter-type-intersect
#Если Не ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Параметры статуса ЭДО форма документа.
// 
// Возвращаемое значение:
//  Структура - Параметры статуса ЭДО форма документа:
// * Форма - ФормаКлиентскогоПриложения
// * Ссылка - ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО
// * Организация - ОпределяемыйТип.Организация
// * Контрагент - ОпределяемыйТип.УчастникЭДО
// * Направление - ПеречислениеСсылка.НаправленияЭДО - направление документа, для которого получаем статус
Функция ПараметрыСтатусаЭДО_ФормаДокумента() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("Форма", Неопределено);
	Результат.Вставить("Ссылка", Неопределено);
	Результат.Вставить("Организация", Неопределено);
	Результат.Вставить("Контрагент", Неопределено);
	Результат.Вставить("Направление", Перечисления.НаправленияЭДО.ПустаяСсылка());
    //@skip-check constructor-function-return-section
    Возврат Результат;
КонецФункции

// Направления ЭДО.
// 
// Возвращаемое значение:
//  Структура - Направления ЭДО:
// * Исходящий - ПеречислениеСсылка.НаправленияЭДО - 
// * Входящий - ПеречислениеСсылка.НаправленияЭДО - 
// * Интеркампани - ПеречислениеСсылка.НаправленияЭДО - 
// * Внутренний - ПеречислениеСсылка.НаправленияЭДО - 
Функция НаправленияЭДО() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("Исходящий", Перечисления.НаправленияЭДО.Исходящий);
	Результат.Вставить("Входящий", Перечисления.НаправленияЭДО.Входящий);
	Результат.Вставить("Интеркампани", Перечисления.НаправленияЭДО.Интеркампани);
	Результат.Вставить("Внутренний", Перечисления.НаправленияЭДО.Внутренний);
	Возврат Результат;
КонецФункции
	
// Добавление статуса ЭДО в событии "ПриСозданииНаСервере"
// 
// Параметры:
//  ПараметрыСтатусаЭДО - см. ПараметрыСтатусаЭДО_ФормаДокумента
Процедура ПриСозданииНаСервере(ПараметрыСтатусаЭДО) Экспорт
	ПодготовитьСтатус(ПараметрыСтатусаЭДО);
КонецПроцедуры

// Обновление статуса ЭДО в событии "ПриЧтениииНаСервере"
// 
// Параметры:
//  ПараметрыСтатусаЭДО - см. ПараметрыСтатусаЭДО_ФормаДокумента
Процедура ПриЧтениииНаСервере(ПараметрыСтатусаЭДО) Экспорт
	ПриИзмененииКлючевыхРеквизитовСтатусЭДО(ПараметрыСтатусаЭДО);
КонецПроцедуры

// При изменении ключевых реквизитов для расчета статуса ЭДО.
// Выполняет обновление статуса ЭДО на форме.
// 
// Параметры:
//  ПараметрыСтатусаЭДО - см. ПараметрыСтатусаЭДО_ФормаДокумента
Процедура ПриИзмененииКлючевыхРеквизитовСтатусЭДО(ПараметрыСтатусаЭДО) Экспорт
	ПодготовитьСтатус(ПараметрыСтатусаЭДО);
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ПараметрыСтатусаЭДО.Форма);
КонецПроцедуры

Процедура ПослеЗаписиНаСервере(ПараметрыСтатусаЭДО) Экспорт
	ПриИзмененииКлючевыхРеквизитовСтатусЭДО(ПараметрыСтатусаЭДО);
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Параметры:
//  СостояниеЭДО - ПеречислениеСсылка.СостоянияДокументовЭДО
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.СтатусыЭДО - Получить статус по состоянию
Функция ПолучитьСтатусПоСостоянию(СостояниеЭДО) Экспорт
	Если Не ЗначениеЗаполнено(СостояниеЭДО) 
			Или СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.НеСформирован
			Или СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ЗакрытПринудительно Тогда
		Возврат Перечисления.СтатусыЭДО.Создать;
	КонецЕсли;
	Если СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписание
		Или СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписаниеАннулирования
		Или СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписаниеИзвещения
		Или СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписаниеОтклонения Тогда
		Возврат Перечисления.СтатусыЭДО.Подписание;
	КонецЕсли;
	Если СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяУтверждение Тогда
		Возврат Перечисления.СтатусыЭДО.Утвердить;
	КонецЕсли;
	Если СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ОжидаетсяПередачаОператору
		Или СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяОтправка
		Или СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяОтправкаАннулирования
		Или СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяОтправкаИзвещения
		Или СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяОтправкаИзвещенияПоОтклонению
		Или СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяОтправкаОтклонения
		Или СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяОтправкаПриглашения
		Или СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяПовторнаяОтправка
		Или СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодготовкаКОтправке
		Или СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодготовкаКОтправкеАннулирования
		Или СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодготовкаКОтправкеИзвещения
		Или СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодготовкаКОтправкеИзвещенияПоОтклонению
		Или СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодтверждениеАннулирования Тогда
		Возврат Перечисления.СтатусыЭДО.Отправить;
	КонецЕсли;
	Если СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяУточнение Тогда
		Возврат Перечисления.СтатусыЭДО.Уточнить;
	КонецЕсли;
	Если СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.Аннулирован
		Или СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ЗакрытСОтклонением
		Или СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ЗакрытСОшибкойПередачи
		Или СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ОжидаетсяИсправление
		Или СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяИсправлениеОшибкиПередачи Тогда
		Возврат Перечисления.СтатусыЭДО.Исправить;
	КонецЕсли;
	Если СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ОбменЗавершен
		Или СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ОбменЗавершенСИсправлением Тогда
		Возврат Перечисления.СтатусыЭДО.Завершен;
	КонецЕсли;
	Если СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ОжидаетсяИзвещениеПоОтклонению Тогда
		Возврат Перечисления.СтатусыЭДО.Отклонен;
	КонецЕсли;
	Если СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ОжидаетсяИзвещениеОПолучении
		Или СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ОжидаетсяОтветНаПриглашение
		Или СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ОжидаетсяПодтверждение
		Или СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ОжидаетсяПодтверждениеАннулирования
		Или СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ОжидаетсяПодтверждениеОператора
		Или СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяИзвещениеОПолучении
		Или СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяИзвещениеПоОтклонению
		Или СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяИзвещениеПоОтклонению Тогда
		Возврат Перечисления.СтатусыЭДО.Отправлен;
	КонецЕсли;
	Если СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.НеПолучен Тогда
		Возврат Перечисления.СтатусыЭДО.НеПолучен;
	КонецЕсли;
	Если СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ЗакрытСОтклонениемПриглашения Тогда
		Возврат Перечисления.СтатусыЭДО.Пригласить;
	КонецЕсли;
	Возврат Перечисления.СтатусыЭДО.Создать;
КонецФункции

// Получить статус.
// 
// Параметры:
//  ПараметрыСтатусаЭДО - см. ПараметрыСтатусаЭДО_ФормаДокумента
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.СтатусыЭДО
Функция ПолучитьСтатус(ПараметрыСтатусаЭДО) Экспорт
	Отбор = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрыСтатусаЭДО.Организация);
	ОбъектУчета = ПараметрыСтатусаЭДО.Ссылка;
	Если Не СинхронизацияЭДО.ЕстьУчетныеЗаписи(Отбор) Тогда
		Возврат Перечисления.СтатусыЭДО.Подключить;
	КонецЕсли;
	ТребуетсяПриглашение = Не НастройкиЭДО.ЕстьНастройкиОтправки(ПараметрыСтатусаЭДО.Организация, 
		ПараметрыСтатусаЭДО.Контрагент) И Не ИнтеграцияЭДО.АктуальныеЭлектронныеДокументы(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОбъектУчета)).Количество() > 0;
	Если ТребуетсяПриглашение Тогда
		Возврат Перечисления.СтатусыЭДО.Пригласить;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбъектУчета) Тогда
		Возврат ПолучитьСтратусПоСостояниюЭДО(ОбъектУчета);
	КонецЕсли;
	Возврат Перечисления.СтатусыЭДО.Создать;
КонецФункции

// Возвращает картинку статуса по значению статуса
// 
// Параметры:
//  ТекущийСтатус - ПеречислениеСсылка.СтатусыЭДО - Текущий статус
// 
// Возвращаемое значение:
//  Картинка - Картинка по статусу
Функция КартинкаПоСтатусу(ТекущийСтатус) Экспорт
	Если ТекущийСтатус = Перечисления.СтатусыЭДО.Подключить
		Или ТекущийСтатус = Перечисления.СтатусыЭДО.Пригласить 
		Или ТекущийСтатус = Перечисления.СтатусыЭДО.Создать 
		Или ТекущийСтатус = Перечисления.СтатусыЭДО.НеПолучен Тогда
		Возврат БиблиотекаКартинок.СтатусСерый;
	ИначеЕсли ТекущийСтатус = Перечисления.СтатусыЭДО.Завершен Тогда
		Возврат БиблиотекаКартинок.СтатусЗеленый
	Иначе
		Возврат БиблиотекаКартинок.СтатусСиний;
	КонецЕсли;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  ОбъектУчета - ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.СтатусыЭДО - Получить стратус по состоянию ЭДО
Функция ПолучитьСтратусПоСостояниюЭДО(ОбъектУчета)
	ТекущееСостояние = ИнтеграцияЭДО.РассчитатьСостояниеОбъектаУчета(ОбъектУчета);
	Статус = ПолучитьСтатусПоСостоянию(ТекущееСостояние.Состояние);
	Возврат Статус;
КонецФункции

Процедура ПодготовитьСтатус(ПараметрыСтатусаЭДО)
	Форма = ПараметрыСтатусаЭДО.Форма;
	ТекущийСтатус = ПолучитьСтатус(ПараметрыСтатусаЭДО);
	Если Не НастройкиЭДО.ЕстьПравоНастройкиОбмена() 
		Или ОбщегоНазначения.ЭтоМобильныйКлиент() 
		Или Не ЭлектронныеДокументыЭДО.ЕстьПравоЧтенияДокументов()
		Или Не ЗначениеЗаполнено(ПараметрыСтатусаЭДО.Организация)
		Или Не НастройкиЭДО.ИспользуетсяОбменЭлектроннымиДокументами() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ИмяРеквизитаПараметровСтатусаЭДО = "ЭДО_ПараметрыСтатуса";
	
	РеквизитСуществует = Ложь;
	Для Каждого Реквизит Из Форма.ПолучитьРеквизиты() Цикл
		Если Реквизит.Имя = ИмяРеквизитаПараметровСтатусаЭДО Тогда
			РеквизитСуществует = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не РеквизитСуществует Тогда
		Реквизиты = Новый Массив; // Массив из РеквизитФормы -
	    Реквизиты.Добавить(Новый РеквизитФормы(ИмяРеквизитаПараметровСтатусаЭДО, Новый ОписаниеТипов())); 
		Форма.ИзменитьРеквизиты(Реквизиты);
	КонецЕсли;
	ЭДО_ПараметрыСтатуса = Новый Структура;
	ЭДО_ПараметрыСтатуса.Вставить("Ссылка", ПараметрыСтатусаЭДО.Ссылка);
	ЭДО_ПараметрыСтатуса.Вставить("Организация", ПараметрыСтатусаЭДО.Организация);
	ЭДО_ПараметрыСтатуса.Вставить("Контрагент", ПараметрыСтатусаЭДО.Контрагент);
	ЭДО_ПараметрыСтатуса.Вставить("Направление", ПараметрыСтатусаЭДО.Направление);
	ЭДО_ПараметрыСтатуса.Вставить("СтатусЭДО", ТекущийСтатус);
	//@skip-check property-return-type
	Форма.ЭДО_ПараметрыСтатуса = ЭДО_ПараметрыСтатуса;
	
	ПараметрыСтатуса = ОбщегоНазначения.ПараметрыСтатуса();
	ПараметрыСтатуса.Наименование = Строка(ТекущийСтатус);
	ПараметрыСтатуса.Картинка = КартинкаПоСтатусу(ТекущийСтатус);
	ПараметрыСтатуса.Идентификатор = "СтатусЭДО";
	ПараметрыСтатуса.Обработчик = "ПодключаемыеСтатусыЭДОКлиент.ПерейтиКДетальномуОписаниюСтатуса";
	ОбщегоНазначения.ДобавитьСтатус(Форма, ПараметрыСтатуса);
КонецПроцедуры

#КонецОбласти

#КонецЕсли
